# Data Cleaning

In [1]:
# Missing values filling applied only when those column is important for prediction
# e.g., Parents name column is not important for prediction of performance so then we dont need to fill in the missing values

# During evaluation we need to be clear of the data set and why that column only has missing values filled
# when only very less data is missing then we dont need to apply data imputation

- Data preprocessing we need to do two processes:
    - Data Cleaning
    - Data Scaling: we bring the data into the same range(scale)

- General Types of data:
    - Quantitative: expressed in numbers or numerical values
        - Discrete : whole numbers e.g., no of employees
        - continuous: real numbers e.g., average height
    - Qualitative: represents characters and cannot be represented in numbers(categorical)
        - ordinal: has some order e.g., shirt sizes
        - nominal: has no order  e.g., male or female

- NUMERICAL: Data points are exact numbers
- CATEGORICAL: Data represents characteristics
- TIME SERIES: Data over a range of time
- TEXT DATA: Data in the form of text

- Missing data handling:
    - Keep
    - Remove
    - Replace(Imputation)

In [2]:
import numpy as np
import pandas as pd

In [3]:
df=pd.read_csv('D:\SEM 3\Data Preprocessing Lab\Data Cleaning_part1_dataset_movie scores.csv')

In [4]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

# Checking and Selecting Null Values

In [5]:
df.isnull() # null postion is indicated by true value

   first_name  last_name    age  Gender  pre_movie_score  post_movie_score
0       False      False  False   False            False             False
1        True       True   True    True             True              True
2       False      False  False   False             True              True
3       False      False  False   False            False             False
4       False      False  False   False            False             False

In [6]:
df.notnull() # not null positions is indicated by Truevalues

   first_name  last_name    age  Gender  pre_movie_score  post_movie_score
0        True       True   True    True             True              True
1       False      False  False   False            False             False
2        True       True   True    True            False             False
3        True       True   True    True             True              True
4        True       True   True    True             True              True

# non-null values from particular row or column

In [7]:
df['first_name']

0     Root
1      NaN
2    Stark
3    Sofie
4     Emma
Name: first_name, dtype: object

In [8]:
df[df['first_name'].notnull()]

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

# non-null and null values from multiple row or column

In [9]:
df[df['pre_movie_score'].isnull() & df['Gender'].notnull()]

  first_name last_name   age Gender  pre_movie_score  post_movie_score
2      Stark      Mike  48.0      m              NaN               NaN

# How to drop or replace null values?

In [10]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [11]:
help(df.dropna)

Help on method dropna in module pandas.core.frame:

dropna(*, axis: 'Axis' = 0, how: 'str | NoDefault' = <no_default>, thresh: 'int | NoDefault' = <no_default>, subset: 'IndexLabel' = None, inplace: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Remove missing values.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Determine if rows or columns which contain missing values are
        removed.

        * 0, or 'index' : Drop rows which contain missing values.
        * 1, or 'columns' : Drop columns which contain missing value.

        .. versionchanged:: 1.0.0

           Pass tuple or list to drop on multiple axes.
           Only a single axis is allowed.

    how : {'any', 'all'}, default 'any'
        Determine if row or column is removed from DataFrame, when we have
        at least one NA or all NA.

        * 'any' : If any NA values are present, drop that row or column.
        * 'all' : If all values are NA, drop that row or column.

    thresh : int, optional
        Require that many non-NA values. Cannot be combined with how.
    subset : column label or sequence of labels, optional
        Labels along other axis to consider, e.g. if you are dropping rows
        these would be a list of columns to include.
    inplace : bool, default False
        Whether to modify the DataFrame rather than creating a new one.

    Returns
    -------
    DataFrame or None
        DataFrame with NA entries dropped from it or None if ``inplace=True``.

    See Also
    --------
    DataFrame.isna: Indicate missing values.
    DataFrame.notna : Indicate existing (non-missing) values.
    DataFrame.fillna : Replace missing values.
    Series.dropna : Drop missing values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
    ...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
    ...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
    ...                             pd.NaT]})
    >>> df
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Drop the rows where at least one element is missing.

    >>> df.dropna()
         name        toy       born
    1  Batman  Batmobile 1940-04-25

    Drop the columns where at least one element is missing.

    >>> df.dropna(axis='columns')
           name
    0    Alfred
    1    Batman
    2  Catwoman

    Drop the rows where all elements are missing.

    >>> df.dropna(how='all')
           name        toy       born
    0    Alfred        NaN        NaT
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep only the rows with at least 2 non-NA values.

    >>> df.dropna(thresh=2)
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Define in which columns to look for missing values.

    >>> df.dropna(subset=['name', 'toy'])
           name        toy       born
    1    Batman  Batmobile 1940-04-25
    2  Catwoman   Bullwhip        NaT

    Keep the DataFrame with valid entries in the same variable.

    >>> df.dropna(inplace=True)
    >>> df
         name        toy       born
    1  Batman  Batmobile 1940-04-25

# Missing value count along Columns

In [12]:
df.isna().sum()

first_name          1
last_name           1
age                 1
Gender              1
pre_movie_score     2
post_movie_score    2
dtype: int64

In [13]:
(df.isna().sum()).sum() #total count of missing values

8

# Drop rows contains null values

In [14]:
# axis=0, axis=1 for rows and columns respectively

df1=df.dropna(axis=0) #drop rows with missing values
                      # inplace=True then the values get changed in original data frame

In [15]:
df1

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [16]:
df2=df.dropna(axis=1)

In [17]:
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [18]:
df3=df.dropna(thresh=1) #axis=0 default

In [19]:
df3

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [20]:
df4=df.dropna(thresh=1,axis=1)

In [21]:
df4

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [22]:
#how{'any','all'}, default 'any'

In [23]:
df6=df.dropna(how='any')

In [24]:
df6

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [25]:
df7=df.dropna(how="all")

In [26]:
df7

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

- Replace missing values:
    - Imputatation using mean/median
    - Imputation using most frequent or zero/constant
    - k-NN

# Fill null value data

In [28]:
df.fillna("NEW") #Fills all the missing values without any regard to the data type

  first_name last_name   age Gender pre_movie_score post_movie_score
0       Root      Joss  36.0      m             8.0              9.0
1        NEW       NEW   NEW    NEW             NEW              NEW
2      Stark      Mike  48.0      m             NEW              NEW
3      Sofie    Miller  39.0      f             7.0              8.0
4       Emma       Roy  84.0      f             6.0              8.0

In [29]:
df.fillna(10) #int to float and int to str also defaulty happens

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1         10        10  10.0     10             10.0              10.0
2      Stark      Mike  48.0      m             10.0              10.0
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [31]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [33]:
df['age'].fillna(5) #age column NaN gets filled with 5.0 since float data type

0    36.0
1     5.0
2    48.0
3    39.0
4    84.0
Name: age, dtype: float64

In [36]:
df['first_name'].fillna("Empty") #doesnt get updated in df

0     Root
1    Empty
2    Stark
3    Sofie
4     Emma
Name: first_name, dtype: object

In [37]:
df['first_name']=df['first_name'].fillna("Empty") # Empty replaces the NaN in the original df

In [38]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1      Empty       NaN   NaN    NaN              NaN               NaN
2      Stark      Mike  48.0      m              NaN               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [39]:
df['Gender'].fillna("not specified")

0                m
1    not specified
2                m
3                f
4                f
Name: Gender, dtype: object

## Data Imputation

- Fill the mean of pre_movie_score for the NaN values in the pre-movie_score

In [40]:
df['pre_movie_score']

0    8.0
1    NaN
2    NaN
3    7.0
4    6.0
Name: pre_movie_score, dtype: float64

In [41]:
df['pre_movie_score'].mean()

7.0

In [42]:
df['pre_movie_score'].fillna(df['pre_movie_score'].mean(),inplace=True)

In [43]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0               9.0
1      Empty       NaN   NaN    NaN              7.0               NaN
2      Stark      Mike  48.0      m              7.0               NaN
3      Sofie    Miller  39.0      f              7.0               8.0
4       Emma       Roy  84.0      f              6.0               8.0

In [44]:
df['post_movie_score'].fillna(df['post_movie_score'].mean(),inplace=True)

In [45]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0          9.000000
1      Empty       NaN   NaN    NaN              7.0          8.333333
2      Stark      Mike  48.0      m              7.0          8.333333
3      Sofie    Miller  39.0      f              7.0          8.000000
4       Emma       Roy  84.0      f              6.0          8.000000

In [51]:
df['age'].mean().round()

52.0

In [62]:
df['age'].fillna(df['age'].mean().round(),inplace=True) #age cannot be in decimal #can also use median

In [63]:
df

  first_name last_name   age Gender  pre_movie_score  post_movie_score
0       Root      Joss  36.0      m              8.0          9.000000
1      Empty       NaN  52.0    NaN              7.0          8.333333
2      Stark      Mike  48.0      m              7.0          8.333333
3      Sofie    Miller  39.0      f              7.0          8.000000
4       Emma       Roy  84.0      f              6.0          8.000000

In [64]:
dz=pd.read_csv('D:\SEM 3\Data Preprocessing Lab\Data Cleaning_part1_dataset_Students_expenses.csv')

In [65]:
dz

   Expenses  Riya  Samual   Neeti  Shreya
0   January  8100  6200.0  9200.0  8150.0
1  February  9500  7500.0     NaN  7200.0
2     March  7300  6100.0  8800.0  8100.0
3     April  7800  7200.0  8900.0  7500.0
4       May  8500     NaN  9100.0  7800.0
5      June  9200  7100.0  8850.0     NaN

In [70]:
dz.mean()

C:\Users\ramit\AppData\Local\Temp\ipykernel_8424\672575873.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dz.mean()

Riya      8400.0
Samual    6820.0
Neeti     8970.0
Shreya    7750.0
dtype: float64

In [73]:
dz.fillna(dz.mean()) #only fills the missing values with the means of the respective columns #also works for median

C:\Users\ramit\AppData\Local\Temp\ipykernel_8424\2414450008.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dz.fillna(dz.mean())

   Expenses  Riya  Samual   Neeti  Shreya
0   January  8100  6200.0  9200.0  8150.0
1  February  9500  7500.0  8970.0  7200.0
2     March  7300  6100.0  8800.0  8100.0
3     April  7800  7200.0  8900.0  7500.0
4       May  8500  6820.0  9100.0  7800.0
5      June  9200  7100.0  8850.0  7750.0

In [74]:
dz.fillna(dz.median())

C:\Users\ramit\AppData\Local\Temp\ipykernel_8424\4256846447.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dz.fillna(dz.median())

   Expenses  Riya  Samual   Neeti  Shreya
0   January  8100  6200.0  9200.0  8150.0
1  February  9500  7500.0  8900.0  7200.0
2     March  7300  6100.0  8800.0  8100.0
3     April  7800  7200.0  8900.0  7500.0
4       May  8500  7100.0  9100.0  7800.0
5      June  9200  7100.0  8850.0  7800.0